In [1]:
import numpy as np 
import pandas as pd

In [8]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    26    21     6
1    28     2     2
2     8     2    26
3    12     4    19
4    12     3    26
5    25    14    17
6     3    29    10
7     9    24    21
8     2    11    18
9     9     7     8

In [70]:
len(df.index)

10

In [89]:
mm = np.random.randint(1,51, size = (300000,3))
df2 = pd.DataFrame(mm, columns=["var1", "var2", "var3"])
# df2

In [ ]:
i = 50
listem = []
for s in range(0, len(df2.index)):
    if df2.loc[s, "var1"] == 50:
        df2.loc[s, "var2"] += 10
        listem.append(s)

In [91]:
i = 50
listem = []
for s in range(0, len(df2.index)):
    if df2.iloc[s]["var1"] == 50:
        df2.iloc[s]["var1"] += 10
        listem.append(s)

In [93]:
df[df.var1 > 10]

   var1  var2  var3
0    50   191     6
1    50   172     2
2    50   172    26
3    50   174    19
4    24     3    26
5   110    14    17
7    18    24    21
9    18     7     8

In [94]:
df[(df.var1 > 10) & (df.var3 < 10)]

   var1  var2  var3
0    50   191     6
1    50   172     2
9    18     7     8

In [131]:
foo = ['a', 'b', 'c', 'd', 'e']
np.random.choice(foo)

'c'

In [133]:
import seaborn as sns

In [134]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [135]:
df.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of                method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]>

In [137]:
df.mass.mean()

2.6381605847953216

In [138]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [143]:
df.head(10).describe

<bound method NDFrame.describe of             method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010>

In [145]:
df.shape

(1035, 6)

In [146]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [147]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [150]:
df = pd.DataFrame({"gruplar":["a","b","c","a","b","c"], "veri":[10,11,52,23,43,55]}, columns=["gruplar","veri"])
df

  gruplar  veri
0       a    10
1       b    11
2       c    52
3       a    23
4       b    43
5       c    55

In [156]:
df.groupby("gruplar")

In [157]:
df.groupby("gruplar").mean()

         veri
gruplar
a        16.5
b        27.0
c        53.5

In [158]:
df.groupby("gruplar").sum()

         veri
gruplar
a          33
b          54
c         107

In [159]:
df2 = sns.load_dataset("planets")
df2

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [161]:
df2.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [163]:
df2 = pd.DataFrame({"gruplar":["a","b","c","a","b","c"], "veri1":[10,11,52,23,43,55],"veri2":[100,253,333,262,111,969]}, columns=["gruplar","veri1","veri2"])
df2

  gruplar  veri1  veri2
0       a     10    100
1       b     11    253
2       c     52    333
3       a     23    262
4       b     43    111
5       c     55    969

In [164]:
df2.groupby("gruplar").mean()

         veri1  veri2
gruplar
a         16.5  181.0
b         27.0  182.0
c         53.5  651.0

In [167]:
df2.groupby("gruplar").agg([max, min, np.median])

        veri1            veri2
          max min median   max  min median
gruplar
a          23  10   16.5   262  100    181
b          43  11   27.0   253  111    182
c          55  52   53.5   969  333    651

In [168]:
df2.groupby("gruplar").agg([max, min, np.median])

        veri1            veri2
          max min median   max  min median
gruplar
a          23  10   16.5   262  100    181
b          43  11   27.0   253  111    182
c          55  52   53.5   969  333    651

In [169]:
df2.groupby("gruplar")["veri1"].agg([max, min, np.median])

         max  min  median
gruplar
a         23   10    16.5
b         43   11    27.0
c         55   52    53.5

In [184]:
def filter_func(x):
    return x["veri1"].std() > 9

In [198]:
df2.groupby("gruplar").filter(filter_func)

  gruplar  veri1  veri2
0       a     10    100
1       b     11    253
3       a     23    262
4       b     43    111

In [197]:
df2.groupby("gruplar").std()

             veri1       veri2
gruplar
a         9.192388  114.551299
b        22.627417  100.409163
c         2.121320  449.719913

In [194]:
df_a = df2.iloc[:,1:3]

In [211]:
df2["veri1"].transform(lambda x: x - x.mean())

0   -22.333333
1   -21.333333
2    19.666667
3    -9.333333
4    10.666667
5    22.666667
Name: veri1, dtype: float64

In [206]:
df_a.transform(lambda x: x - x.mean())

       veri1  veri2
0 -22.333333 -238.0
1 -21.333333  -85.0
2  19.666667   -5.0
3  -9.333333  -76.0
4  10.666667 -227.0
5  22.666667  631.0

In [212]:
df_a.transform(lambda x: (x - x.mean()) / x.std())

      veri1     veri2
0 -1.101533 -0.738461
1 -1.052210 -0.263736
2  0.970006 -0.015514
3 -0.460342 -0.235811
4  0.526105 -0.704331
5  1.117974  1.957853

In [213]:
df_a

   veri1  veri2
0     10    100
1     11    253
2     52    333
3     23    262
4     43    111
5     55    969

In [214]:
df_a.apply(np.sum)

veri1     194
veri2    2028
dtype: int64

In [217]:
df_a["veri1"].apply(np.sum)

0    10
1    11
2    52
3    23
4    43
5    55
Name: veri1, dtype: int64

In [218]:
df2.groupby("gruplar").apply(np.sum)

        gruplar  veri1  veri2
gruplar
a            aa     33    362
b            bb     54    364
c            cc    107   1302

In [219]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [220]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [222]:
titanic.groupby("sex")["survived"].describe()

        count      mean       std  min  25%  50%  75%  max
sex
female  314.0  0.742038  0.438211  0.0  0.0  1.0  1.0  1.0
male    577.0  0.188908  0.391775  0.0  0.0  0.0  0.0  1.0

In [224]:
titanic.groupby(["sex", "class"])[["survived"]].agg("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [223]:
titanic.groupby(["sex", "class"])[["survived"]].agg("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [225]:
titanic.pivot_table("survived", index= "sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [229]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [236]:
titanic.pivot_table("survived", ["sex",age],  "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663